/* В некоторой школе решили набрать три новых математических класса и оборудовать кабинеты для них новыми партами.За каждой партой может сидеть два учащихся.Известно количество учащихся в каждом из трех классов.Выведите наименьшее число парт, которое нужно приобрести для них.Каждый класс сидит в своем кабинете.

Формат входных данных

Программа получает на вход три целых неотрицательных числа : количество учащихся в каждом из трех классов(числа не превышают 1000).


Формат выходных данных

Выведите одно целое число - ответ на задачу.

Тестовые данные
№ Теста                1               2
Входные данные    20 , 21 , 22 :  16 , 18 , 20
Выходные данные        32              27
*/



#include <iostream>

using namespace std;

int main() {
    int a, b, c;
    cin >> a >> b >> c;
    cout << (a / 2 + a % 2) + (b / 2 + b % 2) + (c / 2 + c % 2);
    return 0;
}